; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	Star7 - direction
	Star9 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Star6 - direction
	Star10 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation12 - direction
	Star5 - direction
	GroundStation11 - direction
	Star2 - direction
	GroundStation14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star10)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation14)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star6)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation12)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation14)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation11)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite1 GroundStation11)
	(have_image Planet15 thermograph2)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 6
3. (turn_to satellite1 planet16 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet16)
   goals met: 0 of 6
4. (take_image satellite1 planet16 instrument3 image1)
   added: (have_image planet16 image1)
   goals met: 1 of 6
5. (turn_to satellite1 planet15 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet15)
   goals met: 1 of 6
6. (take_image satellite1 planet15 instrument3 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 2 of 6
7. (turn_to satellite1 phenomenon17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon17 instrument3 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 6
9. (turn_to satellite1 star18 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star18)
   goals met: 3 of 6
10. (take_image satellite1 star18 instrument3 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 4 of 6
11. (turn_to satellite1 star19 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star19)
   goals met: 4 of 6
12. (take_image satellite1 star19 instrument3 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 5 of 6
13. (turn_to satellite1 groundstation11 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 groundstation11)
   goals met: 6 of 6
